package com.zds.treedemo.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
public enum ResCodeEnum {

    /**
     * 系统接口报错信息
     */
    ERROR_0("0", "成功"),
    ERROR_1("1", "验证码不存在或已过期，请重新获取验证码"),
    ERROR_2("1017", "验证码错误，请重新输入"),
    ERROR_10001("10001", "导入数据失败"),
    ERROR_10002("10002", "解压文件失败"),
    ERROR_10003("10003", "解析数据文件失败"),
    ERROR_10004("10004", "ES连接异常"),
    ERROR_10005("10005", "其他错误"),
    ERROR_10006("10006", "参数缺失"),
    ERROR_10008("10008", "请先上传Excel文件"),
    ERROR_10009("10009", "部分数据上传出错"),
    ERROR_10010("10010", "Excel文件表头字段缺失: "),
    ERROR_10011("10011", "关键字段缺失: "),
    ERROR_10016("10016", "主键重复"),
    ERROR_10017("10017", "无接口访问权限"),
    ERROR_10018("10018", "已存在该数据，无法添加"),
    ERROR_10030("10030", "登录密码错误"),
    ERROR_10031("10031", "登录失败"),
    ERROR_10033("10033", "token验证失败"),
    ERROR_10034("10034", "验证码错误"),
    ERROR_10035("10035", "该手机号已存在，请核对"),
    ERROR_10036("10036", "该手机号格式有误"),
    ERROR_10037("10037", "未查询到相关数据"),
    ERROR_10038("10038", "重复绑定"),
    ERROR_10039("10039", "数据重复"),
    ERROR_10040("10040", "文件上传失败"),
    ERROR_10041("10041", "文件下载失败"),
    ERROR_10042("10042", "识别失败"),
    ERROR_10043("10043", "非开放区域"),
    ERROR_10045("10045", "记录不存在"),
    ERROR_10046("10046", "获取验证码过于频繁，请稍后再试"),
    ERROR_10047("10047", "当前用户不存在"),
    ERROR_10050("10050", "上传的身份证信息识别存在问题"),
    FAIL("00001", "fail"),
    ERROR_30000("30000", "服务处理异常"),
    ERROR_30001("30001", "当前用户已绑定该银行卡，无需再次绑定"),
    ERROR_30002("30002", "不支持当前银行卡绑定，请更换银行卡"),
    ERROR_30003("30003", "手机号与银行预留手机号不一致"),
    ERROR_30004("30004", "银行卡号与持卡人信息不匹配"),
    ERROR_30005("30005", "请更换对私银行卡"),
    ERROR_30006("30006", "银行卡号输入有误"),
    ERROR_DASHU("40000", "%s"),
    ERROR_ZGC("50000", "%s"),
    ERROR_ESIGN("60000", "%s"),
    ERROR_YUNXIN("70000", "%s"),
    SUCCESS("00000", "success"),
    NOT_AUTH("-1", "未登录"),
    OPERATION_SUCCESS("20000", "操作成功");

    @Getter
    private String code;

    @Getter
    private String message;


}
